src/Documents/ЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаряд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыИЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Обязательно!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНеисправности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехникаКлиента</Name>
					<Comment>Что ремонтируем</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Comment>Когда обещали</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Опционально</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыИЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаказНаряд/Forms/ФормаДокумента/Ext/Form/Module.bsl
// МОДУЛЬ ФОРМЫ ДОКУМЕНТА "ЗАКАЗНАРЯД"

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Инициализация формы
КонецПроцедуры

// ===== КНОПКА ДЛЯ АВТОМАТИЧЕСКОЙ ПОДСТАНОВКИ ЦЕН =====

&НаКлиенте
Процедура ПодставитьВсеЦены(Команда)
    
    // 1. Обрабатываем услуги
    Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
        Если СтрокаУслуги.Номенклатура <> Неопределено Тогда
            // Если цена пустая или 0
            Если СтрокаУслуги.Цена = 0 Или СтрокаУслуги.Цена = Неопределено Тогда
                СтрокаУслуги.Цена = 100; // Фиксированная цена для услуг
            КонецЕсли;
            // Пересчет суммы
            СтрокаУслуги.Сумма = СтрокаУслуги.Количество * СтрокаУслуги.Цена;
        КонецЕсли;
    КонецЦикла;
    
    // 2. Обрабатываем материалы
    Для Каждого СтрокаМатериала Из Объект.Материалы Цикл
        Если СтрокаМатериала.Материал <> Неопределено Тогда
            // Если цена пустая или 0
            Если СтрокаМатериала.Цена = 0 Или СтрокаМатериала.Цена = Неопределено Тогда
                СтрокаМатериала.Цена = 50; // Фиксированная цена для материалов
            КонецЕсли;
            // Пересчет суммы
            СтрокаМатериала.Сумма = СтрокаМатериала.Количество * СтрокаМатериала.Цена;
        КонецЕсли;
    КонецЦикла;
    
    Сообщить("Цены и суммы успешно подставлены!");
    
КонецПроцедуры

// ===== ПРОСТЫЕ ОБРАБОТЧИКИ ДЛЯ АВТОМАТИЧЕСКОГО РАСЧЕТА =====

&НаКлиенте
Процедура ПересчитатьСуммуУслуги()
    // Пересчитываем сумму для текущей строки услуг
    ТекСтрока = Объект.Услуги.ТекущаяСтрока();
    Если ТекСтрока <> Неопределено Тогда
        ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуМатериала()
    // Пересчитываем сумму для текущей строки материалов
    ТекСтрока = Объект.Материалы.ТекущаяСтрока();
    Если ТекСтрока <> Неопределено Тогда
        ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
    КонецЕсли;
КонецПроцедуры
